egilll/zephyr-gd32/drivers/sdhc/sdhc_gd32.c
/*
 * Copyright (c) 2026, Ylhyra ehf.
 *
 * SPDX-License-Identifier: Apache-2.0
 */

#define DT_DRV_COMPAT gd_gd32_sdhc

#include <zephyr/kernel.h>
#include <zephyr/devicetree.h>
#include <zephyr/device.h>
#include <zephyr/drivers/sdhc.h>
#include <zephyr/drivers/sdhc/gd32.h>
#include <zephyr/sd/sd_spec.h>
#include <zephyr/sys/util.h>
#include <zephyr/sys/math_extras.h>
#include <zephyr/cache.h>
#include <zephyr/drivers/clock_control.h>
#include <zephyr/drivers/clock_control/gd32.h>
#include <zephyr/drivers/gpio.h>
#include <zephyr/drivers/pinctrl.h>
#include <zephyr/drivers/dma.h>
#include <zephyr/drivers/dma/dma_gd32.h>
#include <zephyr/drivers/reset.h>
#include <zephyr/mem_mgmt/mem_attr.h>
#include <zephyr/logging/log.h>
#include <zephyr/irq.h>
#include <zephyr/sys/atomic.h>

/* GD32 HAL (provided by the SoC HAL module) */
#include <gd32_sdio.h>

LOG_MODULE_REGISTER(sdhc_gd32, CONFIG_SDHC_LOG_LEVEL);

#define GD32_SDHC_DMA_BURST_BYTES 16U

BUILD_ASSERT((CONFIG_SDHC_BUFFER_ALIGNMENT % sizeof(uint32_t)) == 0U,
	     "GD32 SDHC requires word-aligned buffers");

/* SDIOCLK input to the SDIO peripheral on GD32F4xx is 48MHz. */
#define GD32_SDIOCLK_HZ       48000000U
#define GD32_SDIO_DATATIMEOUT 0xFFFFFFFFU

/* Optional extra pinctrl states to match bus speed */
#define PINCTRL_STATE_SLOW PINCTRL_STATE_PRIV_START
#define PINCTRL_STATE_FAST (PINCTRL_STATE_PRIV_START + 1U)

#define GD32_SDIO_INT_CLEAR_ALL                                                                    \
	(SDIO_INT_FLAG_CCRCERR | SDIO_INT_FLAG_DTCRCERR | SDIO_INT_FLAG_CMDTMOUT |                 \
	 SDIO_INT_FLAG_DTTMOUT | SDIO_INT_FLAG_TXURE | SDIO_INT_FLAG_RXORE |                       \
	 SDIO_INT_FLAG_CMDRECV | SDIO_INT_FLAG_CMDSEND | SDIO_INT_FLAG_DTEND |                     \
	 SDIO_INT_FLAG_STBITE | SDIO_INT_FLAG_DTBLKEND | SDIO_INT_FLAG_SDIOINT |                   \
	 SDIO_INT_FLAG_ATAEND)

#define GD32_SDIO_INT_CLEAR_XFER                                                                   \
	(GD32_SDIO_INT_CLEAR_ALL & ~(SDIO_INT_FLAG_SDIOINT | SDIO_INT_FLAG_ATAEND))

#define GD32_SDIO_INT_CMD_MASK                                                                     \
	(SDIO_INT_CMDRECV | SDIO_INT_CMDSEND | SDIO_INT_CCRCERR | SDIO_INT_CMDTMOUT |              \
	 SDIO_INT_STBITE)

#define GD32_SDIO_INT_DATA_MASK                                                                    \
	(SDIO_INT_DTEND | SDIO_INT_DTCRCERR | SDIO_INT_DTTMOUT | SDIO_INT_TXURE | SDIO_INT_RXORE | \
	 SDIO_INT_STBITE | SDIO_INT_DTBLKEND)

#define GD32_SDIO_FIFO_WORDS 32U

enum gd32_sdhc_xfer_err {
	GD32_SDHC_ERR_NONE = 0U,
	GD32_SDHC_ERR_CMD_CRC = BIT(0),
	GD32_SDHC_ERR_CMD_TIMEOUT = BIT(1),
	GD32_SDHC_ERR_DATA_CRC = BIT(2),
	GD32_SDHC_ERR_DATA_TIMEOUT = BIT(3),
	GD32_SDHC_ERR_TX_UNDERRUN = BIT(4),
	GD32_SDHC_ERR_RX_OVERRUN = BIT(5),
	GD32_SDHC_ERR_START_BIT = BIT(6),
	GD32_SDHC_ERR_CARD_REMOVED = BIT(7),
};

enum gd32_sdhc_event {
	GD32_SDHC_EVENT_CMD_DONE = BIT(0),
	GD32_SDHC_EVENT_DMA_DONE = BIT(1),
	GD32_SDHC_EVENT_CMD_ARMED = BIT(2),
	GD32_SDHC_EVENT_DATA_ARMED = BIT(3),
	GD32_SDHC_EVENT_CARD_REMOVED = BIT(4),
};

#if defined(CONFIG_SDHC_GD32_TEST)
enum gd32_sdhc_test_fault {
	GD32_SDHC_TEST_DROP_DMA_CALLBACK,
	GD32_SDHC_TEST_MASK_TERMINAL_INTERRUPTS,
	GD32_SDHC_TEST_MASK_DTBLKEND_INTERRUPT,
	GD32_SDHC_TEST_INJECT_DATA_CRC_ERROR,
};

static atomic_t gd32_sdhc_test_faults;

void gd32_sdhc_test_drop_next_dma_callback(void)
{
	atomic_set_bit(&gd32_sdhc_test_faults, GD32_SDHC_TEST_DROP_DMA_CALLBACK);
}

void gd32_sdhc_test_mask_next_terminal_interrupts(void)
{
	atomic_set_bit(&gd32_sdhc_test_faults, GD32_SDHC_TEST_MASK_TERMINAL_INTERRUPTS);
}

void gd32_sdhc_test_mask_next_dtblkend_interrupt(void)
{
	atomic_set_bit(&gd32_sdhc_test_faults, GD32_SDHC_TEST_MASK_DTBLKEND_INTERRUPT);
}

void gd32_sdhc_test_inject_next_data_crc_error(void)
{
	atomic_set_bit(&gd32_sdhc_test_faults, GD32_SDHC_TEST_INJECT_DATA_CRC_ERROR);
}
#endif

struct gd32_sdhc_dma_chan {
	const struct device *dev;
	uint32_t channel;
#if DT_HAS_COMPAT_STATUS_OKAY(gd_gd32_dma_v1)
	uint32_t slot;
#endif
};

struct gd32_sdhc_config {
	uint16_t clkid;
	const struct pinctrl_dev_config *pcfg;
	void (*irq_config_func)(const struct device *dev);

	struct gpio_dt_spec cd_gpio;
	struct gd32_sdhc_dma_chan dma;
	uint32_t fifo_addr;
	struct reset_dt_spec reset;

	uint8_t bus_width;
	uint32_t power_delay_ms;
	uint32_t min_bus_freq;
	uint32_t max_bus_freq;
	uint32_t max_current_330;
	uint32_t max_current_300;
	uint32_t max_current_180;
};

struct gd32_sdhc_data {
	struct k_mutex lock;
	struct k_sem completion_sem;
	atomic_t events;

	atomic_t cmd_err;
	atomic_t data_err;
	atomic_t data_events;
	volatile int dma_status;

	sdhc_interrupt_cb_t card_cb;
	void *card_cb_user_data;

	struct gpio_callback cd_cb;
	const struct device *dev;

	uint32_t last_r1_err_flags;
	uint32_t clock;
	uint8_t enabled_sources;
	uint8_t bus_width;
	uint8_t power_mode;
	uint8_t dma_direction;
	bool cd_present;
	bool dma_configured;
};

static void gd32_sdhc_abort_io(const struct device *dev);

static inline bool gd32_sdhc_is_card_removed(const struct gd32_sdhc_data *data)
{
	return (atomic_get(&data->events) & GD32_SDHC_EVENT_CARD_REMOVED) != 0;
}

static void gd32_sdhc_signal_card_removed(struct gd32_sdhc_data *data)
{
	atomic_or(&data->events, GD32_SDHC_EVENT_CARD_REMOVED);
	k_sem_give(&data->completion_sem);
}

static void gd32_sdhc_signal_card_inserted(struct gd32_sdhc_data *data)
{
	atomic_and(&data->events, ~GD32_SDHC_EVENT_CARD_REMOVED);
}

static int gd32_sdhc_cd_irq_arm(const struct device *dev)
{
	struct gd32_sdhc_data *data = dev->data;
	const struct gd32_sdhc_config *cfg = dev->config;

	if (cfg->cd_gpio.port == NULL) {
		return -ENOTSUP;
	}

	int v = gpio_pin_get_dt(&cfg->cd_gpio);
	if (v < 0) {
		return v;
	}

	data->cd_present = (v > 0);
	if (data->cd_present) {
		gd32_sdhc_signal_card_inserted(data);
	} else {
		gd32_sdhc_signal_card_removed(data);
	}
	return gpio_pin_interrupt_configure_dt(&cfg->cd_gpio, data->cd_present
								      ? GPIO_INT_EDGE_TO_INACTIVE
								      : GPIO_INT_EDGE_TO_ACTIVE);
}

