egilll/zephyr-gd32/drivers/sdhc/sdhc_gd32.c
static void gd32_cd_gpio_cb(const struct device *port, struct gpio_callback *cb,
			    gpio_port_pins_t pins)
{
	ARG_UNUSED(port);
	ARG_UNUSED(pins);

	struct gd32_sdhc_data *data = CONTAINER_OF(cb, struct gd32_sdhc_data, cd_cb);
	const struct device *dev = data->dev;
	const struct gd32_sdhc_config *cfg = dev->config;
	int v = gpio_pin_get_dt(&cfg->cd_gpio);
	if (v < 0) {
		return;
	}

	bool present = (v > 0);
	if (present == data->cd_present) {
		return;
	}
	data->cd_present = present;

	if (!present) {
		gd32_sdhc_signal_card_removed(data);
	} else {
		gd32_sdhc_signal_card_inserted(data);
	}

	int source = present ? SDHC_INT_INSERTED : SDHC_INT_REMOVED;

	if (((data->enabled_sources & source) != 0U) && (data->card_cb != NULL)) {
		data->card_cb(dev, source, data->card_cb_user_data);
	}
	(void)gpio_pin_interrupt_configure_dt(&cfg->cd_gpio, present ? GPIO_INT_EDGE_TO_INACTIVE
								     : GPIO_INT_EDGE_TO_ACTIVE);
}

static void gd32_sdhc_dump_hw_state(const char *tag)
{
	LOG_ERR("%s: STAT=0x%08x INTEN=0x%08x CMDCTL=0x%08x DATACTL=0x%08x DATATO=0x%08x "
		"DATALEN=0x%08x DATACNT=0x%08x",
		tag, SDIO_STAT, SDIO_INTEN, SDIO_CMDCTL, SDIO_DATACTL, SDIO_DATATO, SDIO_DATALEN,
		SDIO_DATACNT);
	LOG_ERR("%s: RSPCMDIDX=0x%08x RESP0=0x%08x RESP1=0x%08x RESP2=0x%08x RESP3=0x%08x", tag,
		SDIO_RSPCMDIDX, SDIO_RESP0, SDIO_RESP1, SDIO_RESP2, SDIO_RESP3);
}

static void gd32_sdhc_log_cmd_error(uint32_t cmd_err)
{
	if ((cmd_err & GD32_SDHC_ERR_CMD_TIMEOUT) != 0U) {
		LOG_ERR("CMD timeout");
	}
	if ((cmd_err & GD32_SDHC_ERR_CMD_CRC) != 0U) {
		LOG_ERR("CMD CRC error");
	}
	if ((cmd_err & GD32_SDHC_ERR_START_BIT) != 0U) {
		LOG_ERR("CMD start-bit error");
	}
}

static void gd32_sdhc_log_data_error(uint32_t data_err, int dma_status)
{
	if (dma_status < 0) {
		LOG_ERR("DMA error: %d", dma_status);
	}
	if ((data_err & GD32_SDHC_ERR_DATA_TIMEOUT) != 0U) {
		LOG_ERR("DATA timeout");
	}
	if ((data_err & GD32_SDHC_ERR_DATA_CRC) != 0U) {
		LOG_ERR("DATA CRC error");
	}
	if ((data_err & GD32_SDHC_ERR_TX_UNDERRUN) != 0U) {
		LOG_ERR("TX underrun");
	}
	if ((data_err & GD32_SDHC_ERR_RX_OVERRUN) != 0U) {
		LOG_ERR("RX overrun");
	}
	if ((data_err & GD32_SDHC_ERR_START_BIT) != 0U) {
		LOG_ERR("DATA start-bit error");
	}
}

static const char *gd32_sdhc_primary_error_str(uint32_t cmd_err, uint32_t data_err, int dma_status)
{
	if ((cmd_err & GD32_SDHC_ERR_CARD_REMOVED) != 0U ||
	    (data_err & GD32_SDHC_ERR_CARD_REMOVED) != 0U) {
		return "Card removed";
	}
	if (dma_status < 0) {
		return "DMA error";
	}
	if ((data_err & GD32_SDHC_ERR_DATA_CRC) != 0U) {
		return "DATA CRC error";
	}
	if ((data_err & GD32_SDHC_ERR_DATA_TIMEOUT) != 0U) {
		return "DATA timeout";
	}
	if ((data_err & GD32_SDHC_ERR_TX_UNDERRUN) != 0U) {
		return "TX underrun";
	}
	if ((data_err & GD32_SDHC_ERR_RX_OVERRUN) != 0U) {
		return "RX overrun";
	}
	if ((data_err & GD32_SDHC_ERR_START_BIT) != 0U) {
		return "DATA start-bit error";
	}
	if ((cmd_err & GD32_SDHC_ERR_CMD_TIMEOUT) != 0U) {
		return "CMD timeout";
	}
	if ((cmd_err & GD32_SDHC_ERR_CMD_CRC) != 0U) {
		return "CMD CRC error";
	}
	if ((cmd_err & GD32_SDHC_ERR_START_BIT) != 0U) {
		return "CMD start-bit error";
	}
	return "I/O error";
}

static uint32_t gd32_sdhc_retry_delay_ms(uint32_t cmd_err, uint32_t data_err, int dma_status)
{
	if ((cmd_err & GD32_SDHC_ERR_CARD_REMOVED) != 0U ||
	    (data_err & GD32_SDHC_ERR_CARD_REMOVED) != 0U) {
		return 0U;
	}
	if (dma_status < 0) {
		return 10U;
	}

	if ((data_err & (GD32_SDHC_ERR_DATA_CRC | GD32_SDHC_ERR_START_BIT)) != 0U) {
		return 50U;
	}

	if (data_err != 0U) {
		return 20U;
	}

	if ((cmd_err & GD32_SDHC_ERR_CMD_TIMEOUT) != 0U) {
		return 5U;
	}

	if ((cmd_err & (GD32_SDHC_ERR_CMD_CRC | GD32_SDHC_ERR_START_BIT)) != 0U) {
		return 2U;
	}

	return 5U;
}

static int64_t gd32_sdhc_deadline_from_timeout(int timeout_ms)
{
	return timeout_ms == SDHC_TIMEOUT_FOREVER ? INT64_MAX : k_uptime_get() + MAX(timeout_ms, 0);
}

static int64_t gd32_sdhc_deadline_for_attempts(int timeout_ms, unsigned int attempts)
{
	if (timeout_ms == SDHC_TIMEOUT_FOREVER) {
		return INT64_MAX;
	}

	/* Each explicitly requested retry gets one timeout plus bounded cleanup/backoff time. */
	uint64_t budget_ms = (uint64_t)MAX(timeout_ms, 0) * attempts;

	budget_ms += (uint64_t)100U * attempts;
	return k_uptime_get() + (int64_t)MIN(budget_ms, (uint64_t)INT64_MAX / 2U);
}

static int gd32_sdhc_timeout_before_deadline(int requested_ms, int64_t deadline_ms)
{
	if (deadline_ms == INT64_MAX) {
		return requested_ms;
	}

	int64_t remaining_ms = deadline_ms - k_uptime_get();

	if (remaining_ms <= 0) {
		return 0;
	}
	remaining_ms = MIN(remaining_ms, (int64_t)INT_MAX);

	if (requested_ms == SDHC_TIMEOUT_FOREVER) {
		return (int)remaining_ms;
	}

	return MIN(MAX(requested_ms, 0), (int)remaining_ms);
}

static void gd32_sdhc_log_r1_error_bits(uint32_t r1)
{
	uint32_t err = r1 & SD_R1_ERR_FLAGS;

	if (err == 0U) {
		return;
	}

	LOG_ERR("R1 error flags: 0x%08x (state=%u ready=%u)", err, SD_R1_CURRENT_STATE(r1),
		(r1 & SD_R1_RDY_DATA) != 0U);

	if ((err & SD_R1_OUT_OF_RANGE) != 0U) {
		LOG_ERR("R1: OUT_OF_RANGE");
	}
	if ((err & SD_R1_ADDR_ERR) != 0U) {
		LOG_ERR("R1: ADDR_ERR");
	}
	if ((err & SD_R1_BLOCK_LEN_ERR) != 0U) {
		LOG_ERR("R1: BLOCK_LEN_ERR");
	}
	if ((err & SD_R1_ERASE_SEQ_ERR) != 0U) {
		LOG_ERR("R1: ERASE_SEQ_ERR");
	}
	if ((err & SD_R1_ERASE_PARAM) != 0U) {
		LOG_ERR("R1: ERASE_PARAM");
	}
	if ((err & SD_R1_WP_VIOLATION) != 0U) {
		LOG_ERR("R1: WP_VIOLATION");
	}
	if ((err & SD_R1_CARD_LOCKED) != 0U) {
		LOG_ERR("R1: CARD_LOCKED");
	}
	if ((err & SD_R1_UNLOCK_FAIL) != 0U) {
		LOG_ERR("R1: UNLOCK_FAIL");
	}
	if ((err & SD_R1_CRC_ERR) != 0U) {
		LOG_ERR("R1: CRC_ERR");
	}
	if ((err & SD_R1_ILLEGAL_CMD) != 0U) {
		LOG_ERR("R1: ILLEGAL_CMD");
	}
	if ((err & SD_R1_ECC_FAIL) != 0U) {
		LOG_ERR("R1: ECC_FAIL");
	}
	if ((err & SD_R1_CC_ERR) != 0U) {
		LOG_ERR("R1: CC_ERR");
	}
	if ((err & SD_R1_ERR) != 0U) {
		LOG_ERR("R1: ERR");
	}
	if ((err & SD_R1_CSD_OVERWRITE) != 0U) {
		LOG_ERR("R1: CSD_OVERWRITE");
	}
	if ((err & SD_R1_ERASE_SKIP) != 0U) {
		LOG_ERR("R1: ERASE_SKIP");
	}
	if ((err & SD_R1_AUTH_ERR) != 0U) {
		LOG_ERR("R1: AUTH_ERR");
	}
}

