egilll/zephyr-gd32/drivers/sdhc/sdhc_gd32.c
static void gd32_sdhc_maybe_log_response(struct gd32_sdhc_data *data,
					 const struct sdhc_command *cmd)
{
	uint32_t native = cmd->response_type & SDHC_NATIVE_RESPONSE_MASK;

	if (native == SD_RSP_TYPE_NONE) {
		return;
	}

	if (native == SD_RSP_TYPE_R2) {
		LOG_DBG("CMD%u resp=%08x %08x %08x %08x", cmd->opcode, cmd->response[0],
			cmd->response[1], cmd->response[2], cmd->response[3]);
		return;
	}

	uint32_t r0 = cmd->response[0];

	if (cmd->opcode == SD_SEND_STATUS) {
		uint32_t err = r0 & SD_R1_ERR_FLAGS;
		bool log_err = (err != 0U) && (err != data->last_r1_err_flags);

		if (log_err) {
			LOG_ERR("CMD13 status=0x%08x (state=%u ready=%u)", r0,
				SD_R1_CURRENT_STATE(r0), (r0 & SD_R1_RDY_DATA) != 0U);
			gd32_sdhc_log_r1_error_bits(r0);
			data->last_r1_err_flags = err;
		}

		LOG_DBG("CMD13 status=0x%08x (state=%u ready=%u err=0x%08x)", r0,
			SD_R1_CURRENT_STATE(r0), (r0 & SD_R1_RDY_DATA) != 0U, err);
		return;
	}

	LOG_DBG("CMD%u resp0=0x%08x", cmd->opcode, r0);

	if ((native == SD_RSP_TYPE_R1) || (native == SD_RSP_TYPE_R1b)) {
		uint32_t err = r0 & SD_R1_ERR_FLAGS;
		if ((err != 0U) && (err != data->last_r1_err_flags)) {
			LOG_ERR("CMD%u R1 error: 0x%08x (state=%u ready=%u)", cmd->opcode, r0,
				SD_R1_CURRENT_STATE(r0), (r0 & SD_R1_RDY_DATA) != 0U);
			gd32_sdhc_log_r1_error_bits(r0);
			data->last_r1_err_flags = err;
		}
	}
}

static inline uint32_t gd32_sdio_datablocksize_get(uint16_t bytes)
{
	uint8_t exp_val = 0U;

	while (bytes > 1U) {
		bytes >>= 1U;
		exp_val++;
	}

	return DATACTL_BLKSZ(exp_val);
}

static inline void gd32_sdio_sync(void)
{
	(void)SDIO_STAT;
}

static inline void gd32_sdhc_register_sync(void)
{
	/** The register bridge needs 3 SDIOCLK + 2 PCLK2 cycles, less than 1 us. */
	k_busy_wait(1U);
}

static inline void gd32_sdhc_write_datactl(uint32_t value)
{
	gd32_sdhc_register_sync();
	SDIO_DATACTL = value;
}

static inline void gd32_sdhc_write_cmdctl(uint32_t value)
{
	gd32_sdhc_register_sync();
	SDIO_CMDCTL = value;
}

static inline void gd32_sdhc_write_clkctl(uint32_t value)
{
	gd32_sdhc_register_sync();
	SDIO_CLKCTL = value;
}

static inline void gd32_sdhc_write_pwrctl(uint32_t value)
{
	gd32_sdhc_register_sync();
	SDIO_PWRCTL = value;
}

static uint32_t gd32_sdhc_timeout_to_cycles(const struct gd32_sdhc_data *data, int timeout_ms)
{
	if (timeout_ms == SDHC_TIMEOUT_FOREVER) {
		return GD32_SDIO_DATATIMEOUT;
	}

	uint32_t clock_hz = data->clock;
	if (clock_hz == 0U) {
		clock_hz = SDMMC_CLOCK_400KHZ;
	}

	uint64_t cycles = ((uint64_t)timeout_ms * (uint64_t)clock_hz) / 1000U;
	if (cycles == 0U) {
		cycles = 1U;
	}

	return (cycles > UINT32_MAX) ? UINT32_MAX : (uint32_t)cycles;
}

static uint32_t gd32_sdhc_harvest_data_status(struct gd32_sdhc_data *data, uint32_t status)
{
	uint32_t latched = status & GD32_SDIO_INT_DATA_MASK;

	if ((latched & SDIO_INT_FLAG_DTCRCERR) != 0U) {
		atomic_or(&data->data_err, GD32_SDHC_ERR_DATA_CRC);
	}
	if ((latched & SDIO_INT_FLAG_DTTMOUT) != 0U) {
		atomic_or(&data->data_err, GD32_SDHC_ERR_DATA_TIMEOUT);
	}
	if ((latched & SDIO_INT_FLAG_TXURE) != 0U) {
		atomic_or(&data->data_err, GD32_SDHC_ERR_TX_UNDERRUN);
	}
	if ((latched & SDIO_INT_FLAG_RXORE) != 0U) {
		atomic_or(&data->data_err, GD32_SDHC_ERR_RX_OVERRUN);
	}
	if ((latched & SDIO_INT_FLAG_STBITE) != 0U) {
		atomic_or(&data->data_err, GD32_SDHC_ERR_START_BIT);
	}
	atomic_or(&data->data_events, latched & (SDIO_INT_FLAG_DTEND | SDIO_INT_FLAG_DTBLKEND));
	return latched;
}

static void gd32_sdhc_isr(const struct device *dev)
{
	struct gd32_sdhc_data *data = dev->data;
	uint32_t pending = SDIO_STAT & SDIO_INTEN;
	atomic_val_t events = atomic_get(&data->events);
	bool cmd_armed = (events & GD32_SDHC_EVENT_CMD_ARMED) != 0;
	bool data_armed = (events & GD32_SDHC_EVENT_DATA_ARMED) != 0;
	bool notify = false;

	if (pending == 0U) {
		return;
	}

	/* SDIO card interrupt (function interrupt) */
	if ((pending & SDIO_INT_FLAG_SDIOINT) != 0U) {
		sdio_interrupt_flag_clear(SDIO_INT_FLAG_SDIOINT);
		if ((data->enabled_sources & SDHC_INT_SDIO) != 0 && data->card_cb != NULL) {
			data->card_cb(dev, SDHC_INT_SDIO, data->card_cb_user_data);
		}
		pending &= ~SDIO_INT_FLAG_SDIOINT;
	}

	if (cmd_armed && ((pending & (SDIO_INT_FLAG_CCRCERR | SDIO_INT_FLAG_CMDTMOUT)) != 0U)) {
		if ((pending & SDIO_INT_FLAG_CCRCERR) != 0U) {
			atomic_or(&data->cmd_err, GD32_SDHC_ERR_CMD_CRC);
		}
		if ((pending & SDIO_INT_FLAG_CMDTMOUT) != 0U) {
			atomic_or(&data->cmd_err, GD32_SDHC_ERR_CMD_TIMEOUT);
		}
		notify = true;
	}

	if (cmd_armed && ((pending & (SDIO_INT_FLAG_CMDRECV | SDIO_INT_FLAG_CMDSEND)) != 0U)) {
		atomic_or(&data->events, GD32_SDHC_EVENT_CMD_DONE);
		notify = true;
	}

	uint32_t data_pending = pending;

	if (cmd_armed) {
		data_pending &= ~SDIO_INT_FLAG_STBITE;
	}
	if (data_armed && (gd32_sdhc_harvest_data_status(data, data_pending) != 0U)) {
		notify = true;
	}

	if ((pending & SDIO_INT_FLAG_STBITE) != 0U) {
		if (cmd_armed) {
			atomic_or(&data->cmd_err, GD32_SDHC_ERR_START_BIT);
		} else if (data_armed) {
			atomic_or(&data->data_err, GD32_SDHC_ERR_START_BIT);
		}
		notify |= cmd_armed || data_armed;
	}

	/* Clear all latched interrupt flags we have enabled. */
	sdio_interrupt_flag_clear(pending & GD32_SDIO_INT_CLEAR_ALL);
	if (notify) {
		k_sem_give(&data->completion_sem);
	}
}

static void gd32_sdhc_dma_cb(const struct device *dma_dev, void *user_data, uint32_t channel,
			     int status)
{
	ARG_UNUSED(dma_dev);
	ARG_UNUSED(channel);

	const struct device *sdhc = user_data;
	struct gd32_sdhc_data *data = sdhc->data;

#if defined(CONFIG_SDHC_GD32_TEST)
	if (atomic_test_and_clear_bit(&gd32_sdhc_test_faults, GD32_SDHC_TEST_DROP_DMA_CALLBACK)) {
		return;
	}
#endif

	data->dma_status = status;
	atomic_or(&data->events, GD32_SDHC_EVENT_DMA_DONE);
	k_sem_give(&data->completion_sem);
}

static uint32_t gd32_sdhc_calc_f_max(uint32_t f_max_dt)
{
	return MIN(f_max_dt, GD32_SDIOCLK_HZ);
}

static int gd32_sdhc_reset(const struct device *dev)
{
	struct gd32_sdhc_data *data = dev->data;
	const struct gd32_sdhc_config *cfg = dev->config;

	LOG_DBG("Reset");

	k_mutex_lock(&data->lock, K_FOREVER);

	sdio_interrupt_disable(0xFFFFFFFFU);
	gd32_sdhc_write_datactl(0U);
	gd32_sdhc_write_cmdctl(0U);
	sdio_interrupt_flag_clear(GD32_SDIO_INT_CLEAR_ALL);
	gd32_sdio_sync();

