egilll/zephyr-gd32/drivers/sdhc/sdhc_gd32.c
	if (cfg->dma.dev != NULL) {
		(void)dma_stop(cfg->dma.dev, cfg->dma.channel);
	}

	data->dma_configured = false;

	k_mutex_unlock(&data->lock);
	return 0;
}

static int gd32_sdhc_set_clock(const struct device *dev, uint32_t clock_hz)
{
	const struct gd32_sdhc_config *cfg = dev->config;
	struct gd32_sdhc_data *data = dev->data;

	if (clock_hz == 0U) {
		LOG_DBG("Clock off");
		gd32_sdhc_write_clkctl(SDIO_CLKCTL & ~(SDIO_CLKCTL_CLKEN | SDIO_CLKCTL_HWCLKEN));
		data->clock = 0U;
		return 0;
	}

	if ((clock_hz < cfg->min_bus_freq) ||
	    (clock_hz > gd32_sdhc_calc_f_max(cfg->max_bus_freq))) {
		LOG_ERR("Clock out of range: %uHz (min=%u max=%u)", clock_hz, cfg->min_bus_freq,
			gd32_sdhc_calc_f_max(cfg->max_bus_freq));
		return -EINVAL;
	}

	LOG_DBG("Clock set: %uHz", clock_hz);

	uint32_t clkctl = SDIO_CLKCTL & SDIO_CLKCTL_BUSMODE;

	if (clock_hz >= GD32_SDIOCLK_HZ) {
		clkctl |= SDIO_CLKCTL_CLKBYP;
	} else {
		uint32_t denom = DIV_ROUND_UP(GD32_SDIOCLK_HZ, clock_hz);
		denom = CLAMP(denom, 2U, 513U);
		uint16_t div = (uint16_t)(denom - 2U);

		clkctl |= div & SDIO_CLKCTL_DIV;
		if (div >= 256U) {
			clkctl |= SDIO_CLKCTL_DIV8;
		}
	}

	if (clock_hz <= SDMMC_CLOCK_400KHZ) {
		(void)pinctrl_apply_state(cfg->pcfg, PINCTRL_STATE_SLOW);
	} else if (clock_hz > 25000000U) {
		(void)pinctrl_apply_state(cfg->pcfg, PINCTRL_STATE_FAST);
	} else {
		(void)pinctrl_apply_state(cfg->pcfg, PINCTRL_STATE_DEFAULT);
	}

	gd32_sdhc_write_clkctl(clkctl | SDIO_CLKCTL_CLKEN);
	data->clock = clock_hz;

	return 0;
}

static int gd32_sdhc_set_io(const struct device *dev, struct sdhc_io *ios)
{
	struct gd32_sdhc_data *data = dev->data;
	const struct gd32_sdhc_config *cfg = dev->config;
	int ret = 0;

	LOG_DBG("Set IO: clk=%u width=%u power=%u timing=%u v=%u", ios->clock, ios->bus_width,
		ios->power_mode, ios->timing, ios->signal_voltage);

	k_mutex_lock(&data->lock, K_FOREVER);

	if ((ios->signal_voltage != 0) && (ios->signal_voltage != SD_VOL_3_3_V)) {
		LOG_WRN("Unsupported signal voltage: %u", ios->signal_voltage);
		ret = -ENOTSUP;
		goto out;
	}

	if ((ios->timing != 0) && (ios->timing != SDHC_TIMING_LEGACY) &&
	    (ios->timing != SDHC_TIMING_HS)) {
		LOG_WRN("Unsupported timing: %u", ios->timing);
		ret = -ENOTSUP;
		goto out;
	}

	if (ios->power_mode == SDHC_POWER_OFF) {
		LOG_DBG("Power off");
		gd32_sdhc_write_pwrctl(SDIO_POWER_OFF);
		data->power_mode = SDHC_POWER_OFF;
	} else if (ios->power_mode == SDHC_POWER_ON) {
		LOG_DBG("Power on");
		gd32_sdhc_write_pwrctl(SDIO_POWER_ON);
		data->power_mode = SDHC_POWER_ON;
	}

	if ((ios->bus_width != 0U) && (data->bus_width != ios->bus_width)) {
		uint32_t bus_mode;

		if ((ios->bus_width == SDHC_BUS_WIDTH8BIT) && (cfg->bus_width < 8U)) {
			LOG_WRN("8-bit bus requested but board supports %u-bit", cfg->bus_width);
			ret = -ENOTSUP;
			goto out;
		}
		if ((ios->bus_width == SDHC_BUS_WIDTH4BIT) && (cfg->bus_width < 4U)) {
			LOG_WRN("4-bit bus requested but board supports %u-bit", cfg->bus_width);
			ret = -ENOTSUP;
			goto out;
		}

		LOG_DBG("Bus width set: %u", ios->bus_width);
		switch (ios->bus_width) {
		case SDHC_BUS_WIDTH1BIT:
			bus_mode = SDIO_BUSMODE_1BIT;
			break;
		case SDHC_BUS_WIDTH4BIT:
			bus_mode = SDIO_BUSMODE_4BIT;
			break;
		case SDHC_BUS_WIDTH8BIT:
			bus_mode = SDIO_BUSMODE_8BIT;
			break;
		default:
			ret = -ENOTSUP;
			goto out;
		}

		gd32_sdhc_write_clkctl((SDIO_CLKCTL & ~SDIO_CLKCTL_BUSMODE) | bus_mode);
		data->bus_width = ios->bus_width;
	}

	if (data->clock != ios->clock) {
		ret = gd32_sdhc_set_clock(dev, ios->clock);
	}

out:
	k_mutex_unlock(&data->lock);
	return ret;
}

static int gd32_sdhc_get_card_present(const struct device *dev)
{
	const struct gd32_sdhc_config *cfg = dev->config;
	struct gd32_sdhc_data *data = dev->data;

	if (cfg->cd_gpio.port == NULL) {
		LOG_DBG("No CD GPIO, assuming present");
		gd32_sdhc_signal_card_inserted(data);
		return 1;
	}

	int v = gpio_pin_get_dt(&cfg->cd_gpio);
	if (v < 0) {
		LOG_WRN("CD gpio_pin_get_dt failed (%d), assuming present", v);
		gd32_sdhc_signal_card_inserted(data);
		return 1;
	}
	bool present = (v > 0);

	LOG_DBG("CD raw=%d present=%d flags=0x%x", v, present ? 1 : 0, cfg->cd_gpio.dt_flags);
	if (present) {
		gd32_sdhc_signal_card_inserted(data);
	} else {
		gd32_sdhc_signal_card_removed(data);
	}
	return present ? 1 : 0;
}

static int gd32_sdhc_card_busy(const struct device *dev)
{
	ARG_UNUSED(dev);

	if ((sdio_flag_get(SDIO_FLAG_CMDRUN) != RESET) ||
	    (sdio_flag_get(SDIO_FLAG_TXRUN) != RESET) ||
	    (sdio_flag_get(SDIO_FLAG_RXRUN) != RESET)) {
		return 1;
	}

	return 0;
}

static int gd32_sdhc_get_host_props(const struct device *dev, struct sdhc_host_props *props)
{
	const struct gd32_sdhc_config *cfg = dev->config;

	memset(props, 0, sizeof(*props));
	props->f_min = cfg->min_bus_freq;
	props->f_max = gd32_sdhc_calc_f_max(cfg->max_bus_freq);
	props->power_delay = cfg->power_delay_ms;
	props->bus_4_bit_support = cfg->bus_width >= 4U;
	props->host_caps.bus_8_bit_support = cfg->bus_width >= 8U;
	props->host_caps.sdma_support = 1;
	props->host_caps.vol_330_support = 1;
	props->max_current_330 = cfg->max_current_330;
	props->max_current_300 = cfg->max_current_300;
	props->max_current_180 = cfg->max_current_180;
	return 0;
}

static int gd32_sdhc_enable_interrupt(const struct device *dev, sdhc_interrupt_cb_t callback,
				      int sources, void *user_data)
{
	struct gd32_sdhc_data *data = dev->data;

	if ((sources & ~(SDHC_INT_SDIO | SDHC_INT_INSERTED | SDHC_INT_REMOVED)) != 0) {
		LOG_WRN("Unsupported interrupt sources: 0x%x", sources);
		return -ENOTSUP;
	}

	if (callback == NULL) {
		return -EINVAL;
	}

	data->card_cb = callback;
	data->card_cb_user_data = user_data;
	data->enabled_sources = sources;

	LOG_DBG("Enable interrupts: 0x%x", sources);

	if ((sources & SDHC_INT_SDIO) != 0) {
		sdio_interrupt_enable(SDIO_INT_SDIOINT);
	}

	return 0;
}

static int gd32_sdhc_disable_interrupt(const struct device *dev, int sources)
{
	struct gd32_sdhc_data *data = dev->data;
	LOG_DBG("Disable interrupts: 0x%x", sources);

	if ((sources & SDHC_INT_SDIO) != 0) {
		sdio_interrupt_disable(SDIO_INT_SDIOINT);
	}

	data->enabled_sources &= ~sources;

