egilll/zephyr-gd32/drivers/sdhc/sdhc_gd32.c
	return 0;
}

static void gd32_sdhc_read_response(struct sdhc_command *cmd)
{
	uint32_t native = cmd->response_type & SDHC_NATIVE_RESPONSE_MASK;

	if (native == SD_RSP_TYPE_R2) {
		cmd->response[0] = sdio_response_get(SDIO_RESPONSE3);
		cmd->response[1] = sdio_response_get(SDIO_RESPONSE2);
		cmd->response[2] = sdio_response_get(SDIO_RESPONSE1);
		cmd->response[3] = sdio_response_get(SDIO_RESPONSE0);
	} else if (native != SD_RSP_TYPE_NONE) {
		cmd->response[0] = sdio_response_get(SDIO_RESPONSE0);
	}
}

static bool gd32_sdhc_resp_has_crc(uint32_t response_type)
{
	switch (response_type & SDHC_NATIVE_RESPONSE_MASK) {
	case SD_RSP_TYPE_R3:
	case SD_RSP_TYPE_R4:
		return false;
	default:
		return (response_type & SDHC_NATIVE_RESPONSE_MASK) != SD_RSP_TYPE_NONE;
	}
}

static bool gd32_sdhc_resp_has_cmdidx(uint32_t response_type)
{
	switch (response_type & SDHC_NATIVE_RESPONSE_MASK) {
	case SD_RSP_TYPE_R1:
	case SD_RSP_TYPE_R1b:
	case SD_RSP_TYPE_R5:
	case SD_RSP_TYPE_R5b:
	case SD_RSP_TYPE_R6:
	case SD_RSP_TYPE_R7:
		return true;
	default:
		return false;
	}
}

static uint32_t gd32_sdhc_resp_sel(uint32_t response_type)
{
	switch (response_type & SDHC_NATIVE_RESPONSE_MASK) {
	case SD_RSP_TYPE_NONE:
		return SDIO_RESPONSETYPE_NO;
	case SD_RSP_TYPE_R2:
		return SDIO_RESPONSETYPE_LONG;
	default:
		return SDIO_RESPONSETYPE_SHORT;
	}
}

static bool gd32_sdhc_cmd_needs_cmdsend(uint32_t response_type)
{
	return (response_type & SDHC_NATIVE_RESPONSE_MASK) == SD_RSP_TYPE_NONE;
}

static int gd32_sdhc_send_cmd(const struct device *dev, struct sdhc_command *cmd, int timeout_ms)
{
	struct gd32_sdhc_data *data = dev->data;
	uint32_t resp = gd32_sdhc_resp_sel(cmd->response_type);
	bool wait_cmdsend = gd32_sdhc_cmd_needs_cmdsend(cmd->response_type);
	bool resp_has_crc = gd32_sdhc_resp_has_crc(cmd->response_type);

	if (gd32_sdhc_is_card_removed(data)) {
		atomic_set(&data->cmd_err, GD32_SDHC_ERR_CARD_REMOVED);
		return -ENODEV;
	}

	LOG_DBG("CMD%u arg=0x%08x resp=%u timeout=%d", cmd->opcode, cmd->arg,
		(unsigned int)(cmd->response_type & SDHC_NATIVE_RESPONSE_MASK), timeout_ms);

	atomic_set(&data->cmd_err, 0);
	atomic_and(&data->events, ~GD32_SDHC_EVENT_CMD_DONE);
	atomic_or(&data->events, GD32_SDHC_EVENT_CMD_ARMED);

	uint32_t cmd_flags = SDIO_INT_FLAG_CCRCERR | SDIO_INT_FLAG_CMDTMOUT |
			     SDIO_INT_FLAG_CMDRECV | SDIO_INT_FLAG_CMDSEND;
	if ((atomic_get(&data->events) & GD32_SDHC_EVENT_DATA_ARMED) == 0) {
		cmd_flags |= SDIO_INT_FLAG_STBITE;
	}
	sdio_interrupt_flag_clear(cmd_flags);

	if (wait_cmdsend) {
		sdio_interrupt_enable(SDIO_INT_CMDSEND | SDIO_INT_CMDTMOUT | SDIO_INT_STBITE);
	} else {
		/*
		 * The GD32 SDIO peripheral may assert CCRCERR even for response
		 * types without a CRC (e.g. R3). Use it as a completion event,
		 * then ignore it when resp_has_crc is false.
		 */
		uint32_t en =
			SDIO_INT_CMDRECV | SDIO_INT_CCRCERR | SDIO_INT_CMDTMOUT | SDIO_INT_STBITE;

		sdio_interrupt_enable(en);
	}

	SDIO_CMDAGMT = cmd->arg;
	gd32_sdhc_write_cmdctl((cmd->opcode & SDIO_CMDCTL_CMDIDX) | resp | SDIO_CMDCTL_CSMEN);

	int ret = 0;
	int64_t deadline = INT64_MAX;

	if (timeout_ms != SDHC_TIMEOUT_FOREVER) {
		deadline = k_uptime_get() + MAX(timeout_ms, 0);
	}
	for (;;) {
		atomic_val_t events = atomic_get(&data->events);

		if ((atomic_get(&data->cmd_err) != 0) ||
		    ((events & GD32_SDHC_EVENT_CMD_DONE) != 0) || gd32_sdhc_is_card_removed(data)) {
			break;
		}

		k_timeout_t timeout = K_FOREVER;

		if (timeout_ms != SDHC_TIMEOUT_FOREVER) {
			int64_t remaining = deadline - k_uptime_get();

			if (remaining <= 0) {
				ret = -ETIMEDOUT;
				break;
			}
			timeout = K_MSEC((uint32_t)remaining);
		}
		if (k_sem_take(&data->completion_sem, timeout) != 0) {
			ret = -ETIMEDOUT;
			break;
		}
	}

	uint32_t disable = GD32_SDIO_INT_CMD_MASK;

	if ((atomic_get(&data->events) & GD32_SDHC_EVENT_DATA_ARMED) != 0) {
		disable &= ~SDIO_INT_STBITE;
	}
	sdio_interrupt_disable(disable);
	atomic_and(&data->events, ~(GD32_SDHC_EVENT_CMD_ARMED | GD32_SDHC_EVENT_CMD_DONE));

	if (gd32_sdhc_is_card_removed(data)) {
		atomic_or(&data->cmd_err, GD32_SDHC_ERR_CARD_REMOVED);
		gd32_sdhc_abort_io(dev);
		return -ENODEV;
	}

	if (ret != 0) {
		LOG_ERR("CMD%u timed out", cmd->opcode);
		gd32_sdhc_dump_hw_state("CMD timeout");
		return -ETIMEDOUT;
	}

	uint32_t cmd_err = (uint32_t)atomic_get(&data->cmd_err);

	if (cmd_err != 0U) {
		if (!resp_has_crc && ((cmd_err & GD32_SDHC_ERR_CMD_CRC) != 0U)) {
			atomic_and(&data->cmd_err, ~GD32_SDHC_ERR_CMD_CRC);
			cmd_err &= ~GD32_SDHC_ERR_CMD_CRC;
		}

		if (cmd_err == 0U) {
			gd32_sdhc_read_response(cmd);
			gd32_sdhc_maybe_log_response(data, cmd);
			return 0;
		}

		LOG_ERR("CMD%u failed (err=0x%x)", cmd->opcode, cmd_err);
		gd32_sdhc_log_cmd_error(cmd_err);
		gd32_sdhc_dump_hw_state("CMD failed");
		if ((cmd_err & GD32_SDHC_ERR_CMD_TIMEOUT) != 0U) {
			return -ETIMEDOUT;
		}
		return -EIO;
	}

	if (gd32_sdhc_resp_has_cmdidx(cmd->response_type) &&
	    (sdio_command_index_get() != cmd->opcode)) {
		LOG_ERR("CMD%u bad cmd index in response (%u)", cmd->opcode,
			sdio_command_index_get());
		gd32_sdhc_dump_hw_state("CMD bad index");
		return -EIO;
	}

	gd32_sdhc_read_response(cmd);
	gd32_sdhc_maybe_log_response(data, cmd);
	return 0;
}

static bool gd32_sdhc_is_write(const struct sdhc_command *cmd)
{
	switch (cmd->opcode) {
	case SD_WRITE_SINGLE_BLOCK:
	case SD_WRITE_MULTIPLE_BLOCK:
		return true;
	case SDIO_RW_EXTENDED:
		return (cmd->arg & BIT(SDIO_CMD_ARG_RW_SHIFT)) != 0U;
	default:
		return false;
	}
}

static bool gd32_sdhc_is_multiblock_rw(const struct sdhc_command *cmd)
{
	return (cmd->opcode == SD_READ_MULTIPLE_BLOCK) || (cmd->opcode == SD_WRITE_MULTIPLE_BLOCK);
}

static uint32_t gd32_sdhc_data_mode(const struct sdhc_command *cmd)
{
	if (cmd->opcode != SDIO_RW_EXTENDED) {
		return SDIO_TRANSMODE_BLOCK;
	}

	/* CMD53 block mode is indicated by BLK bit in argument. */
	bool is_block_mode = (cmd->arg & BIT(SDIO_EXTEND_CMD_ARG_BLK_SHIFT)) != 0U;
	return is_block_mode ? SDIO_TRANSMODE_BLOCK : SDIO_TRANSMODE_STREAM;
}

static bool gd32_sdhc_buf_is_dma_capable(const void *buf, size_t len)
{
#if IS_ENABLED(CONFIG_MEM_ATTR)
	if (IS_ENABLED(CONFIG_MMU) || (len == 0U)) {
		return true;
	}

