egilll/zephyr-gd32/drivers/sdhc/sdhc_gd32.c
	uintptr_t addr = (uintptr_t)buf;
	if ((addr + len) < addr) {
		return false;
	}

	const struct mem_attr_region_t *regions;
	size_t num_regions = mem_attr_get_regions(&regions);
	if (num_regions == 0U) {
		return true;
	}

	for (size_t i = 0; i < num_regions; i++) {
		const struct mem_attr_region_t *region = &regions[i];
		uintptr_t region_end = region->dt_addr + region->dt_size;

		if ((region->dt_attr & DT_MEM_DMA) != DT_MEM_DMA) {
			continue;
		}

		if ((addr >= region->dt_addr) && (addr < region_end) &&
		    ((addr + len) <= region_end)) {
			return true;
		}
	}

	return false;
#else
	ARG_UNUSED(buf);
	ARG_UNUSED(len);
	return true;
#endif
}

static bool gd32_sdhc_data_buf_is_compatible(const struct device *dev, const void *buf, size_t len)
{
	ARG_UNUSED(dev);
	/*
	 * SDIO FIFO access is word-based. This driver configures DMA for 32-bit
	 * transfers (as in the GD32 firmware library `sdcard.c` sample), so the
	 * buffer and length must be word-aligned.
	 */
	return IS_ALIGNED(buf, sizeof(uint32_t)) && ((len % sizeof(uint32_t)) == 0U) &&
	       gd32_sdhc_buf_is_dma_capable(buf, len);
}

static int gd32_sdhc_start_dma(const struct device *dev, bool write, void *dma_buf, size_t dma_len)
{
	const struct gd32_sdhc_config *cfg = dev->config;
	struct gd32_sdhc_data *data = dev->data;
	uint8_t direction = write ? MEMORY_TO_PERIPHERAL : PERIPHERAL_TO_MEMORY;
	uint32_t source = write ? (uint32_t)dma_buf : cfg->fifo_addr;
	uint32_t dest = write ? cfg->fifo_addr : (uint32_t)dma_buf;

	if ((cfg->dma.dev == NULL) || !device_is_ready(cfg->dma.dev)) {
		return -ENODEV;
	}

	data->dma_status = 0;
	atomic_and(&data->events, ~GD32_SDHC_EVENT_DMA_DONE);

	if (data->dma_configured && (data->dma_direction == direction)) {
		int ret = dma_reload(cfg->dma.dev, cfg->dma.channel, source, dest, dma_len);

		if (ret == 0) {
			return 0;
		}
		if (ret != -EBUSY) {
			return ret;
		}
	}

	if (data->dma_configured) {
		int ret = dma_stop(cfg->dma.dev, cfg->dma.channel);

		data->dma_configured = false;
		if (ret != 0) {
			return ret;
		}
	}

	struct dma_block_config blk = {0};
	struct dma_config dma_cfg = {0};

	dma_cfg.channel_direction = direction;
	dma_cfg.source_data_size = 4U;
	dma_cfg.dest_data_size = 4U;
	dma_cfg.source_burst_length = GD32_SDHC_DMA_BURST_BYTES;
	dma_cfg.dest_burst_length = GD32_SDHC_DMA_BURST_BYTES;
	dma_cfg.channel_priority = 3U;
	dma_cfg.block_count = 1U;
	dma_cfg.head_block = &blk;
	dma_cfg.dma_callback = gd32_sdhc_dma_cb;
	dma_cfg.user_data = (void *)dev;

#if DT_HAS_COMPAT_STATUS_OKAY(gd_gd32_dma_v1)
	dma_cfg.dma_slot = cfg->dma.slot;
#endif

	if (write) {
		blk.source_address = source;
		blk.dest_address = dest;
		blk.source_addr_adj = DMA_ADDR_ADJ_INCREMENT;
		blk.dest_addr_adj = DMA_ADDR_ADJ_NO_CHANGE;
	} else {
		blk.source_address = source;
		blk.dest_address = dest;
		blk.source_addr_adj = DMA_ADDR_ADJ_NO_CHANGE;
		blk.dest_addr_adj = DMA_ADDR_ADJ_INCREMENT;
	}

	blk.block_size = (uint32_t)dma_len;
	blk.fifo_mode_control = GD32_DMA_DT_FIFO_MODE(3U);
	blk.flow_control_mode = 0U;

	int ret = dma_config(cfg->dma.dev, cfg->dma.channel, &dma_cfg);
	if (ret != 0) {
		return ret;
	}

	ret = dma_start(cfg->dma.dev, cfg->dma.channel);
	if (ret != 0) {
		return ret;
	}
	data->dma_direction = direction;
	data->dma_configured = true;

	return 0;
}

static void gd32_sdhc_stop_dma(const struct device *dev)
{
	const struct gd32_sdhc_config *cfg = dev->config;
	struct gd32_sdhc_data *data = dev->data;

	if ((cfg->dma.dev != NULL) && device_is_ready(cfg->dma.dev)) {
		(void)dma_stop(cfg->dma.dev, cfg->dma.channel);
	}
	data->dma_configured = false;
}

static int gd32_sdhc_drain_rx_fifo(void)
{
	for (uint32_t words = 0U; words < GD32_SDIO_FIFO_WORDS; words++) {
		if (sdio_flag_get(SDIO_FLAG_RXDTVAL) == RESET) {
			return 0;
		}

		(void)sdio_data_read();
	}

	if (sdio_flag_get(SDIO_FLAG_RXDTVAL) != RESET) {
		/* The data path is already disabled; do not hang if the status bit is stuck. */
		gd32_sdhc_write_datactl(0U);
		gd32_sdio_sync();
		LOG_ERR("RX FIFO did not drain after %u words", GD32_SDIO_FIFO_WORDS);
		return -EIO;
	}

	return 0;
}

static void gd32_sdhc_abort_io(const struct device *dev)
{
	struct gd32_sdhc_data *data = dev->data;
	atomic_val_t events = atomic_get(&data->events);
	bool data_active = ((events & GD32_SDHC_EVENT_DATA_ARMED) != 0) ||
			   ((SDIO_STAT & (SDIO_FLAG_TXRUN | SDIO_FLAG_RXRUN)) != 0U);
	bool cmd_active = ((events & GD32_SDHC_EVENT_CMD_ARMED) != 0) ||
			  ((SDIO_STAT & SDIO_FLAG_CMDRUN) != 0U);

	sdio_interrupt_disable(GD32_SDIO_INT_CMD_MASK | GD32_SDIO_INT_DATA_MASK);
	if (data_active) {
		gd32_sdhc_write_datactl(0U);
		gd32_sdhc_stop_dma(dev);
		(void)gd32_sdhc_drain_rx_fifo();
	}
	if (cmd_active) {
		gd32_sdhc_write_cmdctl(0U);
	}
	atomic_and(&data->events, ~(GD32_SDHC_EVENT_CMD_ARMED | GD32_SDHC_EVENT_DATA_ARMED |
				    GD32_SDHC_EVENT_DMA_DONE));

	sdio_interrupt_flag_clear(GD32_SDIO_INT_CLEAR_XFER);
	gd32_sdio_sync();
}

static void gd32_sdhc_wait_idle_ms(uint32_t timeout_ms)
{
	int64_t deadline = k_uptime_get() + (int64_t)timeout_ms;

	while ((sdio_flag_get(SDIO_FLAG_CMDRUN) != RESET) ||
	       (sdio_flag_get(SDIO_FLAG_TXRUN) != RESET) ||
	       (sdio_flag_get(SDIO_FLAG_RXRUN) != RESET)) {
		if (timeout_ms != 0U && (k_uptime_get() >= deadline)) {
			break;
		}
		k_sleep(K_MSEC(1));
	}
}

static int gd32_sdhc_prepare_data_path(const struct device *dev, const struct sdhc_data *xfer,
				       int timeout_ms)
{
	size_t bytes;

	if (size_mul_overflow((size_t)xfer->block_size, (size_t)xfer->blocks, &bytes) ||
	    (bytes == 0U) || (bytes > SDIO_DATALEN_DATALEN) ||
	    (bytes > (UINT16_MAX * sizeof(uint32_t))) || (xfer->data == NULL)) {
		return -EINVAL;
	}

	if (!is_power_of_two(xfer->block_size) || (xfer->block_size > 16384U)) {
		return -EINVAL;
	}

	uint32_t timeout = gd32_sdhc_timeout_to_cycles(dev->data, timeout_ms);

	sdio_interrupt_flag_clear(GD32_SDIO_INT_DATA_MASK);
	SDIO_DATATO = timeout;
	SDIO_DATALEN = (uint32_t)bytes;

	return 0;
}

static void gd32_sdhc_start_data_path(const struct sdhc_command *cmd, const struct sdhc_data *xfer,
				      bool write)
{
	uint32_t control = gd32_sdio_datablocksize_get(xfer->block_size) |
			   gd32_sdhc_data_mode(cmd) | SDIO_DATACTL_DMAEN | SDIO_DATACTL_DATAEN;

	if (!write) {
		control |= SDIO_DATACTL_DATADIR;
	}
	gd32_sdhc_write_datactl(control);
}

static void gd32_sdhc_enable_data_interrupts(void)
{
	uint32_t mask = GD32_SDIO_INT_DATA_MASK;

#if defined(CONFIG_SDHC_GD32_TEST)
	if (atomic_test_and_clear_bit(&gd32_sdhc_test_faults,
				      GD32_SDHC_TEST_MASK_TERMINAL_INTERRUPTS)) {
		mask &= ~(SDIO_INT_DTEND | SDIO_INT_DTBLKEND);
	} else if (atomic_test_and_clear_bit(&gd32_sdhc_test_faults,
					     GD32_SDHC_TEST_MASK_DTBLKEND_INTERRUPT)) {
		mask &= ~SDIO_INT_DTBLKEND;
	}
#endif
	sdio_interrupt_enable(mask);
}

