egilll/zephyr-gd32/drivers/sdhc/sdhc_gd32.c
static __attribute__((noinline)) int gd32_sdhc_wait_data_done(const struct device *dev, bool write,
							      int64_t deadline_ms)
{
	struct gd32_sdhc_data *data = dev->data;
	const struct gd32_sdhc_config *cfg = dev->config;

	if (gd32_sdhc_is_card_removed(data)) {
		atomic_set(&data->data_err, GD32_SDHC_ERR_CARD_REMOVED);
		return -ENODEV;
	}

#if defined(CONFIG_SDHC_GD32_TEST)
	if (atomic_test_and_clear_bit(&gd32_sdhc_test_faults,
				      GD32_SDHC_TEST_INJECT_DATA_CRC_ERROR)) {
		atomic_or(&data->data_err, GD32_SDHC_ERR_DATA_CRC);
	}
#endif

	for (;;) {
		if (gd32_sdhc_is_card_removed(data)) {
			atomic_or(&data->data_err, GD32_SDHC_ERR_CARD_REMOVED);
			gd32_sdhc_abort_io(dev);
			return -ENODEV;
		}

		uint32_t stat = SDIO_STAT;
		uint32_t latched = gd32_sdhc_harvest_data_status(data, stat);

		if (latched != 0U) {
			sdio_interrupt_flag_clear(latched);
		}

		uint32_t data_err = (uint32_t)atomic_get(&data->data_err);
		uint32_t data_events = (uint32_t)atomic_get(&data->data_events);

		if (write && ((data_err & GD32_SDHC_ERR_DATA_TIMEOUT) != 0U) &&
		    ((data_events & SDIO_INT_FLAG_DTEND) != 0U) && (SDIO_DATACNT == 0U)) {
			atomic_and(&data->data_err, ~GD32_SDHC_ERR_DATA_TIMEOUT);
			data_err &= ~GD32_SDHC_ERR_DATA_TIMEOUT;
		}

		if (data_err != 0U) {
			IF_ENABLED(CONFIG_SDHC_GD32_VERBOSE_DATA_ERRORS, (
				gd32_sdhc_log_data_error(data_err, data->dma_status);
				gd32_sdhc_dump_hw_state("DATA failed");
			))
			return (data_err & GD32_SDHC_ERR_DATA_TIMEOUT) != 0U ? -ETIMEDOUT : -EIO;
		}

		bool dma_done = (atomic_get(&data->events) & GD32_SDHC_EVENT_DMA_DONE) != 0;

		if (!dma_done && (cfg->dma.dev != NULL) && device_is_ready(cfg->dma.dev)) {
			struct dma_status dma_stat;

			if (dma_get_status(cfg->dma.dev, cfg->dma.channel, &dma_stat) == 0) {
				dma_done = dma_stat.pending_length == 0U;
			}
		}
		bool sdio_done = ((data_events & SDIO_INT_FLAG_DTEND) != 0U) &&
				 (SDIO_DATACNT == 0U) &&
				 ((stat & (SDIO_FLAG_TXRUN | SDIO_FLAG_RXRUN)) == 0U);

		if (sdio_done && dma_done) {
			uint32_t terminal = SDIO_STAT;
			uint32_t terminal_latched = gd32_sdhc_harvest_data_status(data, terminal);

			if (terminal_latched != 0U) {
				sdio_interrupt_flag_clear(terminal_latched);
			}
			data_err = (uint32_t)atomic_get(&data->data_err);
			if (write && ((data_err & GD32_SDHC_ERR_DATA_TIMEOUT) != 0U) &&
			    ((atomic_get(&data->data_events) & SDIO_INT_FLAG_DTEND) != 0U) &&
			    (SDIO_DATACNT == 0U)) {
				atomic_and(&data->data_err, ~GD32_SDHC_ERR_DATA_TIMEOUT);
				data_err &= ~GD32_SDHC_ERR_DATA_TIMEOUT;
			}
			if (data_err != 0U) {
				return (data_err & GD32_SDHC_ERR_DATA_TIMEOUT) != 0U ? -ETIMEDOUT
										     : -EIO;
			}
			if ((terminal & (SDIO_FLAG_TXRUN | SDIO_FLAG_RXRUN)) != 0U) {
				continue;
			}
			return data->dma_status < 0 ? -EIO : 0;
		}

		uint32_t wait_ms = 2U;

		if (deadline_ms != INT64_MAX) {
			int64_t remaining = deadline_ms - k_uptime_get();

			if (remaining <= 0) {
				IF_ENABLED(CONFIG_SDHC_GD32_VERBOSE_DATA_ERRORS, (
					gd32_sdhc_dump_hw_state("DATA completion timeout");
				))
				return -ETIMEDOUT;
			}
			wait_ms = MIN(wait_ms, (uint32_t)remaining);
		}
		(void)k_sem_take(&data->completion_sem, K_MSEC(wait_ms));
	}
}

static bool gd32_sdhc_is_transient_data_failure(uint32_t data_err, int dma_status)
{
	if ((data_err & GD32_SDHC_ERR_CARD_REMOVED) != 0U) {
		return false;
	}

	if (dma_status < 0) {
		return true;
	}

	return (data_err &
		(GD32_SDHC_ERR_DATA_CRC | GD32_SDHC_ERR_START_BIT | GD32_SDHC_ERR_TX_UNDERRUN |
		 GD32_SDHC_ERR_RX_OVERRUN | GD32_SDHC_ERR_DATA_TIMEOUT)) != 0U;
}

static int gd32_sdhc_transfer_data_chunk(const struct device *dev, struct sdhc_command *cmd,
					 struct sdhc_data *xfer, int64_t deadline_ms)
{
	struct gd32_sdhc_data *data = dev->data;
	bool write = gd32_sdhc_is_write(cmd);
	size_t bytes;

	xfer->bytes_xfered = 0U;
	if (size_mul_overflow((size_t)xfer->block_size, (size_t)xfer->blocks, &bytes)) {
		return -EINVAL;
	}
	void *dma_buf = xfer->data;
	size_t dma_len = bytes;

	atomic_set(&data->data_err, 0);
	atomic_set(&data->data_events, 0);
	data->dma_status = 0;
	atomic_and(&data->events, ~(GD32_SDHC_EVENT_DMA_DONE | GD32_SDHC_EVENT_DATA_ARMED));

	if (!gd32_sdhc_data_buf_is_compatible(dev, dma_buf, dma_len)) {
		return -ENOTSUP;
	}

	if (write) {
		sys_cache_data_flush_range(dma_buf, dma_len);
	} else {
		sys_cache_data_invd_range(dma_buf, dma_len);
	}

	int timeout_ms = gd32_sdhc_timeout_before_deadline(xfer->timeout_ms, deadline_ms);

	if ((deadline_ms != INT64_MAX) && (timeout_ms == 0)) {
		return -ETIMEDOUT;
	}

	int ret = gd32_sdhc_prepare_data_path(dev, xfer, timeout_ms);
	if (ret != 0) {
		return ret;
	}

	if (!write) {
		/*
		 * Read: arm DMA+DSM before issuing the command. This differs from the GD32
		 * firmware library SDIO sample, which enables DMA after the command.
		 */
		atomic_or(&data->events, GD32_SDHC_EVENT_DATA_ARMED);
		gd32_sdhc_enable_data_interrupts();

		ret = gd32_sdhc_start_dma(dev, write, dma_buf, dma_len);
		if (ret != 0) {
			gd32_sdhc_abort_io(dev);
			return ret;
		}

		gd32_sdhc_start_data_path(cmd, xfer, write);

		timeout_ms = gd32_sdhc_timeout_before_deadline(cmd->timeout_ms, deadline_ms);
		ret = timeout_ms == 0 ? -ETIMEDOUT : gd32_sdhc_send_cmd(dev, cmd, timeout_ms);
		if (ret != 0) {
			gd32_sdhc_abort_io(dev);
			return ret;
		}
	} else {
		/*
		 * Write: issue the command first, then enable DMA+DSM so the host is
		 * ready when the card starts requesting data.
		 */
		timeout_ms = gd32_sdhc_timeout_before_deadline(cmd->timeout_ms, deadline_ms);
		ret = timeout_ms == 0 ? -ETIMEDOUT : gd32_sdhc_send_cmd(dev, cmd, timeout_ms);
		if (ret != 0) {
			gd32_sdhc_abort_io(dev);
			return ret;
		}

		atomic_or(&data->events, GD32_SDHC_EVENT_DATA_ARMED);
		gd32_sdhc_enable_data_interrupts();

		ret = gd32_sdhc_start_dma(dev, write, dma_buf, dma_len);
		if (ret != 0) {
			gd32_sdhc_abort_io(dev);
			return ret;
		}

		gd32_sdhc_start_data_path(cmd, xfer, write);
	}

	ret = gd32_sdhc_wait_data_done(dev, write, deadline_ms);
	uint32_t transfer_cmd_err = (uint32_t)atomic_get(&data->cmd_err);

	sdio_interrupt_disable(GD32_SDIO_INT_DATA_MASK);
	if (ret == 0) {
		atomic_and(&data->events, ~(GD32_SDHC_EVENT_DATA_ARMED | GD32_SDHC_EVENT_DMA_DONE));
	} else {
		gd32_sdhc_abort_io(dev);
	}
	sdio_interrupt_flag_clear(GD32_SDIO_INT_CLEAR_XFER);
	gd32_sdio_sync();

	if (!write && (ret == 0)) {
		sys_cache_data_invd_range(dma_buf, dma_len);
	}

	if (ret == 0) {
		xfer->bytes_xfered = bytes;
	}

	if (gd32_sdhc_is_multiblock_rw(cmd) && (xfer->blocks > 1U)) {
		struct sdhc_command stop = {
			.opcode = SD_STOP_TRANSMISSION,
			.arg = 0U,
			.response_type = SD_RSP_TYPE_R1b,
			.retries = cmd->retries,
			.timeout_ms = cmd->timeout_ms,
		};

		/* CMD12 is mandatory cleanup even if the data-attempt deadline expired. */
		if (stop.timeout_ms != 0) {
			(void)gd32_sdhc_send_cmd(dev, &stop, stop.timeout_ms);
		}
		atomic_set(&data->cmd_err, transfer_cmd_err);
	}

	return ret;
}

static __attribute__((noinline)) int
gd32_sdhc_transfer_data_chunk_with_retries(const struct device *dev, struct sdhc_command *cmd,
					   struct sdhc_data *xfer)
{
	struct gd32_sdhc_data *data = dev->data;
	unsigned int attempts = cmd->retries + 1U;
	int64_t overall_deadline_ms = gd32_sdhc_deadline_for_attempts(xfer->timeout_ms, attempts);
	int last_ret = 0;
	uint32_t last_cmd_err = 0U;
	uint32_t last_data_err = 0U;
	int last_dma_status = 0;
	int ret = 0;
	unsigned int attempts_used = 0U;

	for (unsigned int attempt = 1U; attempt <= attempts; ++attempt) {
		attempts_used = attempt;
		if (gd32_sdhc_is_card_removed(data)) {
			ret = -ENODEV;
			break;
		}
		gd32_sdhc_abort_io(dev);
		gd32_sdhc_wait_idle_ms(20U);

		if (gd32_sdhc_timeout_before_deadline(xfer->timeout_ms, overall_deadline_ms) == 0) {
			ret = -ETIMEDOUT;
			break;
		}

