egilll/zephyr-gd32/drivers/sdhc/sdhc_gd32.c
		int64_t attempt_deadline_ms =
			MIN(overall_deadline_ms, gd32_sdhc_deadline_from_timeout(xfer->timeout_ms));

		ret = gd32_sdhc_transfer_data_chunk(dev, cmd, xfer, attempt_deadline_ms);

		last_ret = ret;
		last_cmd_err = (uint32_t)atomic_get(&data->cmd_err);
		last_data_err = (uint32_t)atomic_get(&data->data_err);
		last_dma_status = data->dma_status;

		if (ret == 0) {
			break;
		}
		if (ret == -ENODEV) {
			break;
		}

		if ((attempt >= attempts) ||
		    !gd32_sdhc_is_transient_data_failure(last_data_err, last_dma_status)) {
			break;
		}

		uint32_t delay_ms =
			gd32_sdhc_retry_delay_ms(last_cmd_err, last_data_err, last_dma_status);
		LOG_INF("Retrying DATA CMD%u (%s) in %ums (%u/%u) (ret=%d cmd_err=0x%x "
			"data_err=0x%x dma=%d)",
			cmd->opcode,
			gd32_sdhc_primary_error_str(last_cmd_err, last_data_err, last_dma_status),
			delay_ms, attempt + 1, attempts, last_ret, last_cmd_err, last_data_err,
			last_dma_status);

		gd32_sdhc_abort_io(dev);
		gd32_sdhc_wait_idle_ms(20U);
		int remaining_ms =
			gd32_sdhc_timeout_before_deadline(xfer->timeout_ms, overall_deadline_ms);

		if (remaining_ms <= 0) {
			ret = -ETIMEDOUT;
			break;
		}
		k_sleep(K_MSEC(MIN(delay_ms, (uint32_t)remaining_ms)));
	}

	if (ret != 0) {
		if (ret == -ENODEV) {
			return ret;
		}
		LOG_ERR("DATA CMD%u failed after %u attempts (ret=%d cmd_err=0x%x data_err=0x%x "
			"dma=%d)",
			cmd->opcode, attempts_used, last_ret, last_cmd_err, last_data_err,
			last_dma_status);
		gd32_sdhc_log_data_error(last_data_err, last_dma_status);
	}

	return ret;
}

static int gd32_sdhc_cmd_with_data(const struct device *dev, struct sdhc_command *cmd,
				   struct sdhc_data *xfer)
{
	return gd32_sdhc_transfer_data_chunk_with_retries(dev, cmd, xfer);
}

static int gd32_sdhc_request(const struct device *dev, struct sdhc_command *cmd,
			     struct sdhc_data *xfer)
{
	struct gd32_sdhc_data *data = dev->data;

	__ASSERT_NO_MSG(cmd != NULL);
	if (cmd->retries == UINT_MAX) {
		return -EINVAL;
	}

	k_mutex_lock(&data->lock, K_FOREVER);

	if (gd32_sdhc_is_card_removed(data)) {
		k_mutex_unlock(&data->lock);
		return -ENODEV;
	}

	int ret = 0;

	if (xfer != NULL) {
		ret = gd32_sdhc_cmd_with_data(dev, cmd, xfer);
	} else {
		unsigned int attempts = cmd->retries + 1U;
		int64_t overall_deadline_ms =
			gd32_sdhc_deadline_for_attempts(cmd->timeout_ms, attempts);
		int last_ret = 0;
		uint32_t last_cmd_err = 0U;

		for (unsigned int attempt = 1U; attempt <= attempts; ++attempt) {
			gd32_sdhc_abort_io(dev);
			gd32_sdhc_wait_idle_ms(20U);

			int64_t attempt_deadline_ms =
				MIN(overall_deadline_ms,
				    gd32_sdhc_deadline_from_timeout(cmd->timeout_ms));
			int timeout_ms = gd32_sdhc_timeout_before_deadline(cmd->timeout_ms,
									   attempt_deadline_ms);

			if (timeout_ms == 0) {
				ret = -ETIMEDOUT;
				break;
			}
			ret = gd32_sdhc_send_cmd(dev, cmd, timeout_ms);
			last_ret = ret;
			last_cmd_err = (uint32_t)atomic_get(&data->cmd_err);

			if (ret == 0) {
				break;
			}
			if (ret == -ENODEV) {
				break;
			}

			if (attempt < attempts) {
				uint32_t delay_ms = gd32_sdhc_retry_delay_ms(last_cmd_err, 0U, 0);
				LOG_INF("Retrying CMD%u (%s) in %ums (%u/%u) (ret=%d cmd_err=0x%x)",
					cmd->opcode,
					gd32_sdhc_primary_error_str(last_cmd_err, 0U, 0), delay_ms,
					attempt + 1, attempts, last_ret, last_cmd_err);

				gd32_sdhc_abort_io(dev);
				gd32_sdhc_wait_idle_ms(20U);
				int remaining_ms = gd32_sdhc_timeout_before_deadline(
					cmd->timeout_ms, overall_deadline_ms);

				if (remaining_ms <= 0) {
					ret = -ETIMEDOUT;
					break;
				}
				k_sleep(K_MSEC(MIN(delay_ms, (uint32_t)remaining_ms)));
			}
		}

		if (ret != 0) {
			if (ret == -ENODEV) {
				k_mutex_unlock(&data->lock);
				return ret;
			}
			LOG_ERR("CMD%u failed after %u attempts (ret=%d cmd_err=0x%x)", cmd->opcode,
				attempts, last_ret, last_cmd_err);
			gd32_sdhc_log_cmd_error(last_cmd_err);
		}
	}

	k_mutex_unlock(&data->lock);
	return ret;
}

static int gd32_sdhc_init(const struct device *dev)
{
	struct gd32_sdhc_data *data = dev->data;
	const struct gd32_sdhc_config *cfg = dev->config;
	int ret;

	data->dev = dev;
	k_mutex_init(&data->lock);
	k_sem_init(&data->completion_sem, 0, 1);
	atomic_set(&data->events, 0);
	atomic_set(&data->cmd_err, 0);
	atomic_set(&data->data_err, 0);
	atomic_set(&data->data_events, 0);
	data->last_r1_err_flags = 0U;
	data->dma_configured = false;

	LOG_INF("Init");

	ret = pinctrl_apply_state(cfg->pcfg, PINCTRL_STATE_DEFAULT);
	if (ret < 0) {
		LOG_ERR("pinctrl_apply_state failed (%d)", ret);
		return ret;
	}

	ret = clock_control_on(GD32_CLOCK_CONTROLLER, (clock_control_subsys_t)&cfg->clkid);
	if (ret != 0) {
		LOG_ERR("clock_control_on failed (%d)", ret);
		return ret;
	}

	if (cfg->reset.dev != NULL) {
		ret = reset_line_toggle_dt(&cfg->reset);
		if (ret != 0) {
			LOG_ERR("reset_line_toggle_dt failed (%d)", ret);
			return ret;
		}
	}

	if (cfg->cd_gpio.port != NULL) {
		if (!gpio_is_ready_dt(&cfg->cd_gpio)) {
			LOG_WRN("CD GPIO not ready");
		} else {
			ret = gpio_pin_configure_dt(&cfg->cd_gpio, GPIO_INPUT);
			if (ret < 0) {
				LOG_ERR("CD gpio_pin_configure_dt failed (%d)", ret);
				return ret;
			}
			data->cd_present = (gpio_pin_get_dt(&cfg->cd_gpio) > 0);
			gpio_init_callback(&data->cd_cb, gd32_cd_gpio_cb, BIT(cfg->cd_gpio.pin));
			ret = gpio_add_callback(cfg->cd_gpio.port, &data->cd_cb);
			if (ret < 0) {
				LOG_ERR("CD gpio_add_callback failed (%d)", ret);
				return ret;
			}
			ret = gd32_sdhc_cd_irq_arm(dev);
			if (ret < 0) {
				LOG_ERR("failed to arm CD interrupt: %d", ret);
				return ret;
			}
		}
	}

	/* Ensure the peripheral is in a known state. */
	sdio_deinit();
	sdio_interrupt_disable(GD32_SDIO_INT_CMD_MASK | GD32_SDIO_INT_DATA_MASK | SDIO_INT_SDIOINT);
	sdio_interrupt_flag_clear(GD32_SDIO_INT_CLEAR_ALL);
	gd32_sdio_sync();

	gd32_sdhc_write_clkctl((SDIO_CLKCTL & ~SDIO_CLKCTL_BUSMODE) | SDIO_BUSMODE_1BIT);
	gd32_sdhc_write_pwrctl(SDIO_POWER_OFF);

	data->bus_width = SDHC_BUS_WIDTH1BIT;
	data->power_mode = SDHC_POWER_OFF;

	ret = gd32_sdhc_set_clock(dev, 0U);
	if (ret != 0) {
		LOG_ERR("Failed to gate clock (%d)", ret);
		return ret;
	}

	LOG_INF("Card present: %d", gd32_sdhc_get_card_present(dev));

