egilll/zephyr-gd32/drivers/sdhc/sdhc_gd32.c
	/* Hook IRQ */
	cfg->irq_config_func(dev);

	LOG_INF("Ready (f_min=%u f_max=%u bus_width=%u)", cfg->min_bus_freq,
		gd32_sdhc_calc_f_max(cfg->max_bus_freq), cfg->bus_width);

	return 0;
}

static DEVICE_API(sdhc, gd32_sdhc_api) = {
	.data_buf_is_compatible = gd32_sdhc_data_buf_is_compatible,
	.reset = gd32_sdhc_reset,
	.request = gd32_sdhc_request,
	.set_io = gd32_sdhc_set_io,
	.get_card_present = gd32_sdhc_get_card_present,
	.execute_tuning = NULL,
	.card_busy = gd32_sdhc_card_busy,
	.get_host_props = gd32_sdhc_get_host_props,
	.enable_interrupt = gd32_sdhc_enable_interrupt,
	.disable_interrupt = gd32_sdhc_disable_interrupt,
};

#define GD32_SDHC_IRQ_CONNECT(inst)                                                                \
	static void gd32_sdhc_irq_config_##inst(const struct device *dev)                          \
	{                                                                                          \
		IRQ_CONNECT(DT_INST_IRQN(inst), DT_INST_IRQ(inst, priority), gd32_sdhc_isr,        \
			    DEVICE_DT_INST_GET(inst), 0);                                          \
		irq_enable(DT_INST_IRQN(inst));                                                    \
	}

#define GD32_SDHC_DMA_INIT(inst)                                                                   \
	.dma = {.dev = DEVICE_DT_GET(DT_INST_DMAS_CTLR(inst)),                                     \
		.channel = DT_INST_DMAS_CELL_BY_IDX(inst, 0, channel),                             \
		COND_CODE_1(DT_HAS_COMPAT_STATUS_OKAY(gd_gd32_dma_v1),                                  \
			    (.slot = DT_INST_DMAS_CELL_BY_IDX(inst, 0, slot),),                    \
			    ()) }

#define GD32_SDHC_FIFO_ADDR(inst) (DT_INST_REG_ADDR(inst) + 0x80U)

#define GD32_SDHC_RESET_INIT(inst) .reset = RESET_DT_SPEC_INST_GET(inst),

#define GD32_SDHC_INIT(inst)                                                                       \
	PINCTRL_DT_INST_DEFINE(inst);                                                              \
	GD32_SDHC_IRQ_CONNECT(inst)                                                                \
	static const struct gd32_sdhc_config gd32_sdhc_config_##inst = {                           \
		.clkid = DT_INST_CLOCKS_CELL(inst, id),                                            \
		.pcfg = PINCTRL_DT_INST_DEV_CONFIG_GET(inst),                                      \
		.irq_config_func = gd32_sdhc_irq_config_##inst,                                    \
		.cd_gpio = GPIO_DT_SPEC_INST_GET_OR(inst, cd_gpios, {0}),                          \
		GD32_SDHC_DMA_INIT(inst),                                                          \
		.fifo_addr = GD32_SDHC_FIFO_ADDR(inst),                                            \
		IF_ENABLED(DT_INST_NODE_HAS_PROP(inst, resets), (GD32_SDHC_RESET_INIT(inst)))      \
		.bus_width = DT_INST_PROP(inst, bus_width),                                        \
			 .power_delay_ms = DT_INST_PROP(inst, power_delay_ms),                     \
			 .min_bus_freq = DT_INST_PROP(inst, min_bus_freq),                         \
			 .max_bus_freq = DT_INST_PROP(inst, max_bus_freq),                         \
			 .max_current_330 = DT_INST_PROP_OR(inst, max_current_330, 0),             \
			 .max_current_300 = DT_INST_PROP_OR(inst, max_current_300, 0),             \
			 .max_current_180 = DT_INST_PROP_OR(inst, max_current_180, 0),             \
	};                                                                                         \
	static struct gd32_sdhc_data gd32_sdhc_data_##inst;                                        \
	DEVICE_DT_INST_DEFINE(inst, &gd32_sdhc_init, NULL, &gd32_sdhc_data_##inst,                 \
			      &gd32_sdhc_config_##inst, POST_KERNEL, CONFIG_SDHC_INIT_PRIORITY,    \
			      &gd32_sdhc_api);

BUILD_ASSERT(DT_NUM_INST_STATUS_OKAY(DT_DRV_COMPAT) == 1,
	     "GD32F4 SDIO register macros support exactly one controller");

DT_INST_FOREACH_STATUS_OKAY(GD32_SDHC_INIT)
